# IsGeoreferenced

## Description
Check if the layer is georeferenced. Pass NIL to check the document.

```pascal
FUNCTION IsGeoreferenced(hLayer : HANDLE) : BOOLEAN;
```

```python

def vs.IsGeoreferenced(hLayer):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hLayer|HANDLE||

## Version
Availability: from Vectorworks 2012
## Category
* GIS